## Pandas is nothing but <span style="color:#F7CCAC; background:#3A3845"> Analysis and Manipulation Tool</span> on top of python
### . mainly used for Data-Science
### . Open source

In [1]:
import pandas as pd

#### Series

In [2]:
pd.Series([10, 20, 30, 40, 50], index=['C', 'C++', 'Java', 'Python', 'R'])

C         10
C++       20
Java      30
Python    40
R         50
dtype: int64

In [3]:
#creating pandas series using python dictionary object
l={1:'A',2:'B',3:'C',4:'D'}
pd.Series(l)

1    A
2    B
3    C
4    D
dtype: object

#### Data Frame
<ul>
<li>Two dimensional table</li>
<li> Made up of a collection of Series </li>
<li>Structured with labeled axes (rows and columns)</li>
<li>You can create a DataFrame using a Python list or a NumPy array</li>
</ul>

In [4]:
data=[
    [1000,'ram',86.29],
    [2000,'bob',97.29],
    [3000,'pat',45.29],
    [2450,'sam',71.29],
    [1001,'joe',52.29],
    ]

In [5]:
list(range(1,len(data)+1))

[1, 2, 3, 4, 5]

In [6]:
pd.DataFrame(data,columns=['Regd. No.','Name','Marks %'],index=[list(range(1,len(data)+1))])

   Regd. No. Name  Marks %
1       1000  ram    86.29
2       2000  bob    97.29
3       3000  pat    45.29
4       2450  sam    71.29
5       1001  joe    52.29

In [7]:
pwd

'e:\\Gole_Niraj\\Programming\\P_Y_T_H_O_N\\_pandas'

#### Reading files using panda

In [8]:
exam_scores= pd.read_csv('../data/exam_scores.csv') #reading file
exam_scores

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,male,group B,bachelor's degree,standard,none,74,68,67
1,female,group C,some college,standard,completed,58,68,66
2,male,group C,some college,free/reduced,none,66,65,65
3,female,group D,bachelor's degree,free/reduced,none,74,75,73
4,male,group D,some college,standard,none,78,77,71
...,...,...,...,...,...,...,...,...
995,female,group C,some high school,standard,none,68,77,72
996,female,group E,some college,standard,none,98,81,94
997,female,group E,associate's degree,free/reduced,none,67,67,67
998,female,group C,high school,standard,none,63,68,70
999,male,group C,some college,free/reduced,none,49,57,50

In [9]:
#checking shape of data-frame
exam_scores.shape

(1000, 8)

In [10]:
# checking first five(default) rows
exam_scores.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,male,group B,bachelor's degree,standard,none,74,68,67
1,female,group C,some college,standard,completed,58,68,66
2,male,group C,some college,free/reduced,none,66,65,65
3,female,group D,bachelor's degree,free/reduced,none,74,75,73
4,male,group D,some college,standard,none,78,77,71

In [11]:
exam_scores.head(2)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,male,group B,bachelor's degree,standard,none,74,68,67
1,female,group C,some college,standard,completed,58,68,66

In [12]:
#checking last five(default) rows
exam_scores.tail()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
995,female,group C,some high school,standard,none,68,77,72
996,female,group E,some college,standard,none,98,81,94
997,female,group E,associate's degree,free/reduced,none,67,67,67
998,female,group C,high school,standard,none,63,68,70
999,male,group C,some college,free/reduced,none,49,57,50

In [13]:
exam_scores.tail(2)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
998,female,group C,high school,standard,none,63,68,70
999,male,group C,some college,free/reduced,none,49,57,50

In [14]:
#data types of data-frame
exam_scores.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [15]:
exam_scores.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

#### Indexing in Pandas
<ul>
<li>loc - label based selection</li>
<li>iloc - index based selection</li>
</ul>

In [16]:
# iloc
exam_scores.iloc[0:3,-1:]

   writing score
0             67
1             66
2             65

In [17]:
#loc
#To get first entry in race/ethnicity
exam_scores.loc[0:5,'race/ethnicity']

0    group B
1    group C
2    group C
3    group D
4    group D
5    group D
Name: race/ethnicity, dtype: object

In [18]:
#loc
#Select first five entries for columns - gender,lunch and math score
exam_scores.loc[0:5,['gender','lunch','math score']]

   gender         lunch  math score
0    male      standard          74
1  female      standard          58
2    male  free/reduced          66
3  female  free/reduced          74
4    male      standard          78
5  female      standard          75

#### Selection based on Columns/Features/Properties
##### It's dot based selection

In [19]:
#To get math scores
#transforming exam_scores in pandas Data-Frame 
df = pd.DataFrame(exam_scores)

In [20]:
df.head()['math score']

0    74
1    58
2    66
3    74
4    78
Name: math score, dtype: int64

In [21]:
#To get math score and gender
#selecting multiple props
df.tail()[['math score', 'gender']]

     math score  gender
995          68  female
996          98  female
997          67  female
998          63  female
999          49    male

#### Conditional Selection

In [22]:
df.head(10).gender=='male'

0     True
1    False
2     True
3    False
4     True
5    False
6    False
7     True
8     True
9     True
Name: gender, dtype: bool

### Assigning
#### This will replace data

In [23]:
df.gender='macho\'s'

In [24]:
df.head().gender

0    macho's
1    macho's
2    macho's
3    macho's
4    macho's
Name: gender, dtype: object

#### Summary Functions

In [25]:
#describe method will provide summary of data
exam_scores.describe()

        math score  reading score  writing score
count  1000.000000     1000.00000    1000.000000
mean     67.128000       70.17400      68.973000
std      14.815367       14.85599      15.109155
min      15.000000       18.00000      10.000000
25%      58.000000       60.00000      59.000000
50%      67.000000       70.00000      69.000000
75%      78.000000       81.00000      80.000000
max     100.000000      100.00000     100.000000

In [26]:
#categorical columns - gender, race/ethnicity (object)
#numerical columns - certificates, time in months (int)
#to get summary about categorical column separately then we can use one parameter 'include'. 
exam_scores.describe(include='object')

,gender,race/ethnicity,parental level of education,lunch,test preparation course
count,1000,1000,1000,1000,1000
unique,1,5,6,2,2
top,macho's,group C,some college,standard,none
freq,1000,294,226,649,654

In [27]:
exam_scores.describe(include='int')

        math score  reading score  writing score
count  1000.000000     1000.00000    1000.000000
mean     67.128000       70.17400      68.973000
std      14.815367       14.85599      15.109155
min      15.000000       18.00000      10.000000
25%      58.000000       60.00000      59.000000
50%      67.000000       70.00000      69.000000
75%      78.000000       81.00000      80.000000
max     100.000000      100.00000     100.000000

In [28]:
#! For categorical columns summary will be NaN 
exam_scores.describe(include='all')

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
count,1000,1000,1000,1000,1000,1000.000000,1000.00000,1000.000000
unique,2,5,6,2,2,NaN,NaN,NaN
top,female,group C,some college,standard,none,NaN,NaN,NaN
freq,502,294,226,649,654,NaN,NaN,NaN
mean,NaN,NaN,NaN,NaN,NaN,67.128000,70.17400,68.973000
std,NaN,NaN,NaN,NaN,NaN,14.815367,14.85599,15.109155
min,NaN,NaN,NaN,NaN,NaN,15.000000,18.00000,10.000000
25%,NaN,NaN,NaN,NaN,NaN,58.000000,60.00000,59.000000
50%,NaN,NaN,NaN,NaN,NaN,67.000000,70.00000,69.000000
75%,NaN,NaN,NaN,NaN,NaN,78.000000,81.00000,80.000000
max,NaN,NaN,NaN,NaN,NaN,100.000000,100.00000,100.000000

In [29]:
#describe can be used to get description about column
exam_scores['math score'].describe()

count    1000.000000
mean       67.128000
std        14.815367
min        15.000000
25%        58.000000
50%        67.000000
75%        78.000000
max       100.000000
Name: math score, dtype: float64

#### Aggregation Function

In [30]:
exam_scores['math score'].mean()

67.128

In [31]:
exam_scores['math score'].median()

67.0

In [32]:
exam_scores['math score'].mode()

0    63
Name: math score, dtype: int64

In [33]:
exam_scores.gender.unique()

array(['male', 'female'], dtype=object)

In [34]:
exam_scores.gender.value_counts()

female    502
male      498
Name: gender, dtype: int64

#### Sorting

In [35]:
exam_scores.sort_values(by='math score', ascending=False).head(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
91,macho's,group D,associate's degree,standard,none,100,94,96
776,macho's,group E,associate's degree,standard,completed,100,100,100
588,macho's,group D,some college,standard,completed,100,85,91
128,macho's,group A,associate's degree,standard,completed,100,97,94
565,macho's,group E,bachelor's degree,standard,completed,100,100,100
911,macho's,group E,some college,standard,none,100,95,87
495,macho's,group C,master's degree,standard,completed,100,96,100
620,macho's,group E,some high school,standard,none,99,87,78
844,macho's,group E,some high school,standard,none,99,95,92
744,macho's,group E,associate's degree,free/reduced,completed,98,100,100

In [36]:
exam_scores['math score'].sort_values(ascending=False).head(8)

91     100
776    100
588    100
128    100
565    100
911    100
495    100
620     99
Name: math score, dtype: int64

#### Renaming Columns

In [37]:
exam_scores.columns

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

In [38]:
# inplace - will make change to original data frame
exam_scores.rename(columns={'math score':'ms'},inplace=True)

In [39]:
exam_scores.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,ms,reading score,writing score
0,macho's,group B,bachelor's degree,standard,none,74,68,67
1,macho's,group C,some college,standard,completed,58,68,66
2,macho's,group C,some college,free/reduced,none,66,65,65
3,macho's,group D,bachelor's degree,free/reduced,none,74,75,73
4,macho's,group D,some college,standard,none,78,77,71

In [40]:
#renaming index
exam_scores.rename(index={0:'zero',1:'one'},inplace=True)
exam_scores.head().ms

zero    74
one     58
2       66
3       74
4       78
Name: ms, dtype: int64

#### Missing Values

In [41]:
exam_scores.isna()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,ms,reading score,writing score
zero,False,False,False,False,False,False,False,False
one,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...
995,False,False,False,False,False,False,False,False
996,False,False,False,False,False,False,False,False
997,False,False,False,False,False,False,False,False
998,False,False,False,False,False,False,False,False
999,False,False,False,False,False,False,False,False

In [42]:
exam_scores.isna().sum()

gender                         0
race/ethnicity                 0
parental level of education    0
lunch                          0
test preparation course        0
ms                             0
reading score                  0
writing score                  0
dtype: int64

In [43]:
#fillna - method will replace NA/NAN values with word 'unknown'
exam_scores.gender.fillna('unknown').head()

zero    macho's
one     macho's
2       macho's
3       macho's
4       macho's
Name: gender, dtype: object